Revit 2026 API

# RebarShapeDrivenAccessorNormal Property

---

A unit-length vector normal to the plane of the rebar

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Normal { get; }
```
```vb
Public ReadOnly Property Normal As XYZ
	Get
```
```cpp
public:
property XYZ^ Normal {
	XYZ^ get ();
}
```
```fsharp
member Normal : XYZ with get
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace